src/cf/DataProcessors/НастройкиМобильногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>НастройкиМобильногоПриложения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/МП_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_ИзмененныеНастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ИзмененныеНастройкиСинхронизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтметкаВремени</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</v8:Type>
						<v8:Type>cfg:EnumRef.МП_ТипыНастроекПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/МП_ТипыНастроекПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МП_ТипыНастроекПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьPushУведомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйРазмерФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграничениеФорматовПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПервичнойЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодробныйПротоколОбменаСМобильнымУстройством</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияМероприятий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияОтсутствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСамочувствий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияУчетаВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокУстареванияДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФорматыПередаваемыхФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРаботПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособУказанияВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/НастройкиМобильногоПриложения/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ТекущийПользователь", ТекущийПользователь);

	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Элементы.ТекущийПользователь.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
	
	Настройки = МП_СлужебныйПовтИсп.НайстройкиПользователя(ТекущийПользователь);

	ЗаполнитьЗначенияЭлементовПоНастройкам(Настройки);
	
	QRКодНастроек(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПользовательПриИзменении(Элемент)
	
	ЗаполнитьЗначенияЭлементовПоНастройкам();
	
	ЗапомнитьЗначения();
	
	QRКодНастроек();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗапомнитьЗначения();
	
	СинхронизироватьПочтуПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройкиНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ТекущийПользователь", ТекущийПользователь);
	
	ОткрытьФорму("Обработка.НастройкиМобильногоПриложения.Форма.ОбщиеНастройки", ПараметрыФормы, ЭтаФорма, , , ,
		Новый ОписаниеОповещения("ОбщиеНастройкиНажатиеЗавершение", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеНастройкиНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		
		//Переформируем QR-код
		QRКодНастроек();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПапкиСинхронизацииНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ТекущийПользователь", ТекущийПользователь);
	
	ОткрытьФорму("Обработка.НастройкиМобильногоПриложения.Форма.ПапкиСинхронизации",
		ПараметрыФормы, ЭтаФорма, , , ,
			Новый ОписаниеОповещения("ВыбратьПапкиСинхронизацииНажатиеЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПапкиСинхронизацииНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИзмененыПапки = Результат;
	
	Если ИзмененыПапки = Истина Тогда
		ЗаполнитьЗначенияЭлементовПоНастройкам();
	КонецЕсли;
	
	НастроитьДоступностьНадписей();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьПочтуПриИзменении(Элемент)
	
	НастроитьДоступностьНадписей();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияУчетаВремениПриИзменении(Элемент)
	
	НастроитьДоступностьНадписей();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроектыСинхронизацииНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("ТекущийПользователь", ТекущийПользователь);
	
	ОткрытьФорму("Обработка.НастройкиМобильногоПриложения.Форма.ВыборПроектовСинхронизации",
		ПараметрыФормы, ЭтаФорма, , , ,
			Новый ОписаниеОповещения("ВыбратьПроектыСинхронизацииНажатиеЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроектыСинхронизацииНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИзмененыПроекты = Результат;
	
	Если ИзмененыПроекты = Истина Тогда
		ЗаполнитьЗначенияЭлементовПоНастройкам();
	КонецЕсли;
	
	НастроитьДоступностьНадписей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)

	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле  = "ТекущийПользователь";
		Сообщение.Текст = "Не выбран пользователь";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	ЗаписатьНастройкиСинхронизацииПоРазделам();
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьУведомленияПоPush(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПодпискиПользователя", Новый Структура("Пользователь", ТекущийПользователь));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкачатьПриложениеНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиМобильногоПриложения.Форма.ВариантыЗагрузки", , ЭтаФорма, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьДоступностьНадписей()
	
	Элементы.НадписьПапкиСинхронизации.Доступность = (СинхронизацияПочты = Истина);
	Элементы.НадписьПроектыСинхронизации.Доступность = (СинхронизацияУчетаВремени = Истина);
	
КонецПроцедуры

&НаСервере
Функция QRКодНастроек(Настройки = Неопределено)

	Если Настройки = Неопределено Тогда
		Настройки = МП_СлужебныйПовтИсп.НайстройкиПользователя(ТекущийПользователь);;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ТекущийПользователь, "ИдентификаторПользователяИБ"));
	
	АдресПодключения = СокрЛП(Константы.АдресПубликацииНаВебСервере.Получить());
	
	Если ПользовательИБ = Неопределено Тогда
		ИмяПользователя = Строка(ТекущийПользователь);
		ПарольУстановлен = 1;
	Иначе
		ИмяПользователя  = ПользовательИБ.Имя;
		ПарольУстановлен = ?(ПользовательИБ.ПарольУстановлен, 1, 0);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ПодробныйПротокол = ?(Настройки.ПодробныйПротоколОбменаСМобильнымУстройством, 1, 0);
	
	СсылкаПараметры = СтрШаблон("%1;%2;%3;%4;%5;%6", 
		АдресПодключения, ИмяПользователя, ПарольУстановлен,
		ПодробныйПротокол, Настройки.СрокУстареванияДанных,
		Настройки.МаксимальныйРазмерФайлов);

	// формируем QR-код
	
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(СсылкаПараметры, 0, 250);

	КодНастроек = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗапомнитьЗначения();
	
	СинхронизируемыеРазделы = Новый Структура;
	
	Для Каждого ЭлементФормы Из Элементы Цикл
		
		ИмяЭлемента = ЭлементФормы.Имя;
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") И ЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка Тогда
			СинхронизируемыеРазделы.Вставить(ИмяЭлемента, ЭтаФорма[ИмяЭлемента]);
		КонецЕсли;
		
	КонецЦикла;

	АдресРазделовСинхронизацииПриОткрытии = ПоместитьВоВременноеХранилище(СинхронизируемыеРазделы,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиСинхронизацииПоРазделам()
	
	РазделыСинхронизацииПриОткрытии = ПолучитьИзВременногоХранилища(
		АдресРазделовСинхронизацииПриОткрытии);
		
	НастройкиИзменены = Ложь;
	ИзмененныеРазделы = Новый Массив;
	Для Каждого КлючИЗначение Из РазделыСинхронизацииПриОткрытии Цикл
		
		ИмяРаздела = КлючИЗначение.Ключ;
		
		Если ЭтаФорма[ИмяРаздела] <> КлючИЗначение.Значение Тогда
			НастройкиИзменены = Истина;
			ТипНастройки = Перечисления.МП_ТипыНастроекПользователей[ИмяРаздела];
			
			РегистрыСведений.МП_НастройкиПользователей.ЗаписатьНастройку(
				ТекущийПользователь, ТипНастройки, ЭтаФорма[ИмяРаздела]);
				
			РегистрыСведений.МП_ИзмененныеНастройкиСинхронизации.ДобавитьЗапись(ТекущийПользователь, 
				ТипНастройки);
			
			ИзмененныеРазделы.Добавить(ИмяРаздела);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияЭлементовПоНастройкам(Настройки = Неопределено)
	
	Если Настройки = Неопределено Тогда
		Настройки = МП_СлужебныйПовтИсп.НайстройкиПользователя(ТекущийПользователь);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти
